In [10]:
import pandas as pd
# import numpy as np
set_path = "/home/bishop/Y2S2/Data Science/Datasets/penguin.csv"
dataset = pd.read_csv(set_path)

In [11]:
dataset.head()

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,1,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,2,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,3,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
3,4,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
4,5,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007

In [12]:
dataset.bill_depth_mm.mean()

np.float64(17.151169590643274)